12/data/attachments/3c4e69b653c6971c.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_2f60d643-61c0-4ce1-9600-b776e76ef1cb</nif:username>
            <nif:friendToBeAdded>Mark_do_Friend_82222_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>